# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
a = pd.Series(np.random.randint( 1, 4 , 100))
b = pd.Series(np.random.randint( 1, 3 , 100))
c = pd.Series(np.random.randint( 10000 , 30000 , 100))

In [3]:
a

0     2
1     1
2     3
3     1
4     3
     ..
95    3
96    3
97    2
98    2
99    2
Length: 100, dtype: int64

In [4]:
b

0     1
1     2
2     2
3     2
4     2
     ..
95    2
96    2
97    2
98    2
99    1
Length: 100, dtype: int64

In [5]:
c

0     19098
1     22437
2     15898
3     24266
4     28370
      ...
95    14520
96    22517
97    12149
98    27269
99    19083
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
a = pd.DataFrame(a)
b = pd.DataFrame(b)
c = pd.DataFrame(c)

In [7]:
abc = pd.concat([a, b, c], axis=1)

In [8]:
abc

    0  0      0
0   2  1  19098
1   1  2  22437
2   3  2  15898
3   1  2  24266
4   3  2  28370
.. .. ..    ...
95  3  2  14520
96  3  2  22517
97  2  2  12149
98  2  2  27269
99  2  1  19083

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [20]:
abc.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

In [21]:
abc

    bedrs  bathrs  price_sqr_meter
0       2       2            27572
1       1       2            24322
2       2       2            16900
3       3       1            14236
4       1       1            28035
..    ...     ...              ...
95      2       1            21052
96      2       1            19299
97      2       1            10006
98      1       2            26876
99      2       2            10273

[100 rows x 3 columns]

In [10]:
#Outra solução
abc rename(columns) = {0: 'bedrs'} , 1: 'bathrs' ,2: 'price_sqr_meter'}

SyntaxError: invalid syntax (<ipython-input-10-8620bb2112c2>, line 2)

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [27]:
bigcolumn = pd.concat([a, b, c], axis=0)

In [32]:
bigcolumn

        0
0       2
1       1
2       2
3       3
4       1
..    ...
95  21052
96  19299
97  10006
98  26876
99  10273

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [30]:
#Como é possível ver abaixo o bigcolumn tem 300 entradas. 
#Entretanto, quando juntamos os 3 dataframes o índeces não foram alterados
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [38]:
bigcolumn.reset_index(drop=True)

         0
0        2
1        1
2        2
3        3
4        1
..     ...
295  21052
296  19299
297  10006
298  26876
299  10273

[300 rows x 1 columns]